MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX150F128D.PIC
      <edc:SFRDef edc:_addr="0x1F80FB54" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="18" edc:access="----------------------------nnnn" edc:cname="RPB10R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB10R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB10R" edc:desc="" edc:mask="0xf" edc:name="RPB10R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB58" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="19" edc:access="----------------------------nnnn" edc:cname="RPB11R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB11R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB11R" edc:desc="" edc:mask="0xf" edc:name="RPB11R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB5C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="20" edc:access="----------------------------nnnn" edc:cname="RPB12R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB12R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB12R" edc:desc="" edc:mask="0xf" edc:name="RPB12R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB60" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="21" edc:access="----------------------------nnnn" edc:cname="RPB13R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB13R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB13R" edc:desc="" edc:mask="0xf" edc:name="RPB13R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB64" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="22" edc:access="----------------------------nnnn" edc:cname="RPB14R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB14R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB14R" edc:desc="" edc:mask="0xf" edc:name="RPB14R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB68" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="23" edc:access="----------------------------nnnn" edc:cname="RPB15R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB15R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB15R" edc:desc="" edc:mask="0xf" edc:name="RPB15R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB6C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="24" edc:access="----------------------------nnnn" edc:cname="RPC0R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC0R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC0R" edc:desc="" edc:mask="0xf" edc:name="RPC0R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB70" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="25" edc:access="----------------------------nnnn" edc:cname="RPC1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC1R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC1R" edc:desc="" edc:mask="0xf" edc:name="RPC1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB74" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="26" edc:access="----------------------------nnnn" edc:cname="RPC2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC2R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC2R" edc:desc="" edc:mask="0xf" edc:name="RPC2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB78" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="27" edc:access="----------------------------nnnn" edc:cname="RPC3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC3R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC3R" edc:desc="" edc:mask="0xf" edc:name="RPC3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
